// Задача №10 - функции обработки массивов
//
// Задан массив [8, 7,  2,  2,  3, 4, 2,  5, 5, 6, 7, 8, 5, 9, 0, 1]
// Напишите функцию uniqueSorted, которая удалит дубликаты из массива и вернет
// отсортированный по возрастанию массив из уникальных значений
//     [0, 1, 2,  3, 4, 5, 6, 7, 8, 9]


function uniqueSorted(arr) {
    return arr.filter((item, index) => !arr.includes(item, index + 1)).sort()
}
let arr = [8, 7,  2,  2,  3, 4, 2,  5, 5, 6, 7, 8, 5, 9, 0, 1];
console.log(uniqueSorted(arr))

